levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmra.c
/**
 *******************************************************************************
 * @file  hc32m423_timera.c
 * @brief This file provides firmware functions to manage the TimerA.
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-02-05       Yangjp          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32m423_timera.h"
#include "hc32m423_utility.h"

/**
 * @addtogroup HC32M423_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_TIMERA TIMERA
 * @brief TimerA Driver Library
 * @{
 */

#if (DDL_TIMERA_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup TIMERA_Local_Macros TimerA Local Macros
 * @{
 */

/**
 * @defgroup TIMERA_Private_Parameter TIMERA Private Parameter
 * @{
 */
#define TIMERA_PWM_CHANNEL_NUMBER           ((uint8_t)0x02U)         /*!< TIMERA PWM channel number */
/**
 * @}
 */

/**
 * @defgroup TIMERA_Hardware_Trigger_Source_Mask TIMERA Hardware Trigger Source Mask
 * @{
 */
#define TIMERA_TRIG_SRC_MASK                ((uint32_t)0x000001FFUL)  /*!< TIMERA Hardware Trigger Source Mask */
/**
 * @}
 */

/**
 * @defgroup TIMERA_Register_Combination_Mask TIMERA Register Combination Mask
 * @{
 */
#define TIMERA_BCONR_BSE_MASK               (TMRA_BCONR_BSE1 | TMRA_BCONR_BSE0)
#define TIMERA_CCONR_HICP_MASK              (TMRA_CCONR_HICP2 | TMRA_CCONR_HICP1 | TMRA_CCONR_HICP0)
#define TIMERA_HCONR_HSTA_MASK              (TMRA_HCONR_HSTA2 | TMRA_HCONR_HSTA1 | TMRA_HCONR_HSTA0)
#define TIMERA_HCONR_HSTP_MASK              (TMRA_HCONR_HSTP2 | TMRA_HCONR_HSTP1 | TMRA_HCONR_HSTP0)
#define TIMERA_HCONR_HCLE_MASK              (TMRA_HCONR_HCLE4 | TMRA_HCONR_HCLE3 | TMRA_HCONR_HCLE2 | \
                                             TMRA_HCONR_HCLE1 | TMRA_HCONR_HCLE0)
#define TIMERA_HCUPR_HCUP_MASK              ((uint16_t)0x1FFFU)
#define TIMERA_HCDOR_HCDO_MASK              ((uint16_t)0x1FFFU)
#define TIMERA_HW_TRIG_MASK                 (TIMERA_HCONR_HSTA_MASK | TIMERA_HCONR_HSTP_MASK | TIMERA_HCONR_HCLE_MASK)
#define TIMERA_EVENT_MASK                   (TIMERA_EVENT_CMP1 | TIMERA_EVENT_CMP2)
#define TIMERA_INT_MASK                     (TIMERA_INT_OVF    | TIMERA_INT_UDF  | \
                                             TIMERA_INT_CMP1   | TIMERA_INT_CMP2)
#define TIMERA_FALG_MASK                    (TIMERA_FLAG_OVF   | TIMERA_FLAG_UDF | \
                                             TIMERA_FLAG_CMP1  | TIMERA_FLAG_CMP2)
/**
 * @}
 */

/**
 * @defgroup TIMERA_CMP_CAP_Register TIMERA Compare/Capture Register
 * @brief Get the specified Compare/Capture register address of the TimerA unit
 * @{
 */
#define TMRA_CMPARx(__TMRAx__, __CH__)      ((uint32_t)(&((__TMRAx__)->CMPAR1)) + ((uint32_t)(__CH__)) << 2U)
#define TMRA_CCONRx(__TMRAx__, __CH__)      ((uint32_t)(&((__TMRAx__)->CCONR1)) + ((uint32_t)(__CH__)) << 2U)
#define TMRA_PCONRx(__TMRAx__, __CH__)      ((uint32_t)(&((__TMRAx__)->PCONR1)) + ((uint32_t)(__CH__)) << 2U)
/**
 * @}
 */

/**
 * @defgroup TIMERA_Check_Parameters_Validity TIMERA Check Parameters Validity
 * @{
 */

#define IS_TIMERA_NORMAL_INSTANCE(x)                                           \
(   (M4_TMRA1 == (x))                           ||                             \
    (M4_TMRA2 == (x))                           ||                             \
    (M4_TMRA3 == (x))                           ||                             \
    (M4_TMRA4 == (x)))

#define IS_TIMERA_SPECIAL_INSTANCE(x)                                          \
(   (M4_TMRA3 == (x))                           ||                             \
    (M4_TMRA4 == (x)))

#define IS_TIMERA_SYNC_INSTANCE(x)                                             \
(   (M4_TMRA2 == (x))                           ||                             \
    (M4_TMRA4 == (x)))

#define IS_TIMERA_CHANNEL(x)                                                   \
(   (TIMERA_CHANNEL_CH1 == (x))                 ||                             \
    (TIMERA_CHANNEL_CH2 == (x)))

#define IS_TIMERA_COUNT_MODE(x)                                                \
(   (TIMERA_SAWTOOTH_WAVE == (x))               ||                             \
    (TIMERA_TRIANGLE_WAVE == (x)))

