levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmra.c
#define IS_TIMERA_COUNT_DIRECTION(x)                                           \
(   (TIMERA_COUNT_UP == (x))                    ||                             \
    (TIMERA_COUNT_DOWN == (x)))

#define IS_TIMERA_SYNC_START(x)                                                \
(   (TIMERA_SYNC_START_ENABLE == (x))           ||                             \
    (TIMERA_SYNC_START_DISABLE == (x)))

#define IS_TIMERA_CLK_DIV(x)                                                   \
(   (TIMERA_CLKDIV_DIV1 == (x))                 ||                             \
    (TIMERA_CLKDIV_DIV2 == (x))                 ||                             \
    (TIMERA_CLKDIV_DIV4 == (x))                 ||                             \
    (TIMERA_CLKDIV_DIV8 == (x))                 ||                             \
    (TIMERA_CLKDIV_DIV16 == (x))                ||                             \
    (TIMERA_CLKDIV_DIV32 == (x))                ||                             \
    (TIMERA_CLKDIV_DIV64 == (x))                ||                             \
    (TIMERA_CLKDIV_DIV128 == (x))               ||                             \
    (TIMERA_CLKDIV_DIV256 == (x))               ||                             \
    (TIMERA_CLKDIV_DIV512 == (x))               ||                             \
    (TIMERA_CLKDIV_DIV1024 == (x)))

#define IS_TIMERA_OVERFLOW_STATE(x)                                            \
(   (TIMERA_OVERFLOW_STOP == (x))               ||                             \
    (TIMERA_OVERFLOW_COUNT == (x)))

#define IS_TIMERA_HWTRIGGER_CONDITION(x)                                       \
(   (!((x) & ((uint16_t)(~TIMERA_HW_TRIG_MASK))))           ||                 \
    (TIMERA_HWSTART_INVALID == (x)))

#define IS_TIMERA_HWSTART_CONDITION(x)                                         \
(   (!((x) & ((uint16_t)(~TIMERA_HCONR_HSTA_MASK))))        ||                 \
    (TIMERA_HWSTART_INVALID == (x)))

#define IS_TIMERA_HWSTOP_CONDITION(x)                                          \
(   (!((x) & ((uint16_t)(~TIMERA_HCONR_HSTP_MASK))))        ||                 \
    (TIMERA_HWSTOP_INVALID == (x)))

#define IS_TIMERA_HWCLEAR_CONDITION(x)                                         \
(   (!((x) & ((uint16_t)(~TIMERA_HCONR_HCLE_MASK))))        ||                 \
    (TIMERA_HWCLEAR_INVALID == (x)))

#define IS_TIMERA_HWUP_CONDITION(x)                                            \
(   (!((x) & ((uint16_t)(~TIMERA_HCUPR_HCUP_MASK))))        ||                 \
    (TIMERA_HWUP_INVALID == (x)))

#define IS_TIMERA_HWDOWN_CONDITION(x)                                          \
(   (!((x) & ((uint16_t)(~TIMERA_HCDOR_HCDO_MASK))))        ||                 \
    (TIMERA_HWDOWN_INVALID == (x)))

#define IS_TIMERA_TRIG_PORT_FILTER_STATE(x)                                    \
(   (TIMERA_TRIG_FILTER_ENABLE == (x))          ||                             \
    (TIMERA_TRIG_FILTER_DISABLE == (x)))

#define IS_TIMERA_TRIG_PORT_FILTER_CLKDIV(x)                                   \
(   (TIMERA_TRIG_CLKDIV_DIV1 == (x))            ||                             \
    (TIMERA_TRIG_CLKDIV_DIV4 == (x))            ||                             \
    (TIMERA_TRIG_CLKDIV_DIV16 == (x))           ||                             \
    (TIMERA_TRIG_CLKDIV_DIV64 == (x)))

#define IS_TIMERA_CLKA_PORT_FILTER_STATE(x)                                    \
(   (TIMERA_CLKA_FILTER_ENABLE == (x))          ||                             \
    (TIMERA_CLKA_FILTER_DISABLE == (x)))

#define IS_TIMERA_CLKA_PORT_FILTER_CLKDIV(x)                                   \
(   (TIMERA_CLKA_CLKDIV_DIV1 == (x))            ||                             \
    (TIMERA_CLKA_CLKDIV_DIV4 == (x))            ||                             \
    (TIMERA_CLKA_CLKDIV_DIV16 == (x))           ||                             \
    (TIMERA_CLKA_CLKDIV_DIV64 == (x)))

#define IS_TIMERA_CLKB_PORT_FILTER_STATE(x)                                    \
(   (TIMERA_CLKB_FILTER_ENABLE == (x))          ||                             \
    (TIMERA_CLKB_FILTER_DISABLE == (x)))

#define IS_TIMERA_CLKB_PORT_FILTER_CLKDIV(x)                                   \
(   (TIMERA_CLKB_CLKDIV_DIV1 == (x))            ||                             \
    (TIMERA_CLKB_CLKDIV_DIV4 == (x))            ||                             \
    (TIMERA_CLKB_CLKDIV_DIV16 == (x))           ||                             \
    (TIMERA_CLKB_CLKDIV_DIV64 == (x)))

#define IS_TIMERA_OC_START_COUNT_OUTPUT_POLARITY(x)                            \
(   (TIMERA_OC_STARTCOUNT_OUTPUT_LOW == (x))    ||                             \
    (TIMERA_OC_STARTCOUNT_OUTPUT_HIGH == (x))   ||                             \
    (TIMERA_OC_STARTCOUNT_OUTPUT_HOLD == (x)))

#define IS_TIMERA_OC_STOP_COUNT_OUTPUT_POLARITY(x)                             \
(   (TIMERA_OC_STOPCOUNT_OUTPUT_LOW == (x))     ||                             \
    (TIMERA_OC_STOPCOUNT_OUTPUT_HIGH == (x))    ||                             \
    (TIMERA_OC_STOPCOUNT_OUTPUT_HOLD == (x)))

#define IS_TIMERA_OC_CMPMATCH_OUTPUT_POLARITY(x)                               \
(   (TIMERA_OC_CMPMATCH_OUTPUT_LOW == (x))      ||                             \
    (TIMERA_OC_CMPMATCH_OUTPUT_HIGH == (x))     ||                             \
    (TIMERA_OC_CMPMATCH_OUTPUT_HOLD == (x))     ||                             \
    (TIMERA_OC_CMPMATCH_OUTPUT_INVERTED == (x)))

#define IS_TIMERA_OC_PERIODMATCH_OUTPUT_POLARITY(x)                            \
(   (TIMERA_OC_PERIODMATCH_OUTPUT_LOW == (x))   ||                             \
    (TIMERA_OC_PERIODMATCH_OUTPUT_HIGH == (x))  ||                             \
    (TIMERA_OC_PERIODMATCH_OUTPUT_HOLD == (x))  ||                             \
    (TIMERA_OC_PERIODMATCH_OUTPUT_INVERTED == (x)))

#define IS_TIMERA_OC_FORCE_OUTPUT_POLARITY(x)                                  \
(   (TIMERA_OC_FORCE_OUTPUT_LOW == (x))         ||                             \
    (TIMERA_OC_FORCE_OUTPUT_HIGH == (x))        ||                             \
    (TIMERA_OC_FORCE_OUTPUT_INVALID == (x)))

