levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmra.c
#define IS_TIMERA_OC_CACHE_STATE(x)                                            \
(   (TIMERA_OC_CACHE_ENABLE == (x))             ||                             \
    (TIMERA_OC_CACHE_DISABLE == (x)))

#define IS_TIMERA_OC_CACHE_TRANS_CONDITION(x)                                  \
(   (!((x) & ((uint16_t)(~TIMERA_BCONR_BSE_MASK))))         ||                 \
    ((x) == TIMERA_OC_CACHE_TRANSMIT_INVALID))

#define IS_TIMERA_IC_PWM_PORT_FILTER_STATE(x)                                  \
(   (TIMERA_IC_PWM_FILTER_ENABLE == (x))        ||                             \
    (TIMERA_IC_PWM_FILTER_DISABLE == (x)))

#define IS_TIMERA_IC_PWM_PORT_FILTER_CLKDIV(x)                                 \
(   (TIMERA_IC_PWM_CLKDIV_DIV1 == (x))          ||                             \
    (TIMERA_IC_PWM_CLKDIV_DIV4 == (x))          ||                             \
    (TIMERA_IC_PWM_CLKDIV_DIV16 == (x))         ||                             \
    (TIMERA_IC_PWM_CLKDIV_DIV64 == (x)))

#define IS_TIMERA_IC_CAPTURE_CONDITION(x)                                      \
(   (!((x) & ((uint16_t)(~TIMERA_CCONR_HICP_MASK))))        ||                 \
    ((x) == TIMERA_IC_INVALID))

#define IS_TIMERA_GET_FLAG(x)                                                  \
(   (TIMERA_FLAG_OVF == (x))                    ||                             \
    (TIMERA_FLAG_UDF == (x))                    ||                             \
    (TIMERA_FLAG_CMP1 == (x))                   ||                             \
    (TIMERA_FLAG_CMP2 == (x)))

#define IS_TIMERA_CLEAR_FLAG(x)                                                \
(   (!((x) & ((uint16_t)(~TIMERA_FALG_MASK))))              &&                 \
    (0U != (x)))

#define IS_TIMERA_INT(x)                                                       \
(   (!((x) & ((uint16_t)(~TIMERA_INT_MASK))))               &&                 \
    (0U != (x)))

#define IS_TIMERA_EVENT(x)                                                     \
(   (!((x) & ((uint16_t)(~TIMERA_EVENT_MASK))))             &&                 \
    (0U != (x)))

/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 * @defgroup TIMERA_Global_Functions TimerA Global Functions
 * @{
 */

/**
 * @brief  De-Initialize TimerA unit base function.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @retval An en_result_t enumeration value:
 *           - Ok: De-Initialize success
 *           - ErrorInvalidParameter: TMRAx is invalid instance
 */
en_result_t TIMERA_DeInit(M4_TMRA_TypeDef *TMRAx)
{
    uint8_t i, u8ChCnt;
    __IO uint16_t *TMRA_CMPAR;
    __IO uint16_t *TMRA_CCONR;
    __IO uint16_t *TMRA_PCONR;
    en_result_t enRet = Ok;

    /* Check TMRAx instance */
    if (!IS_TIMERA_NORMAL_INSTANCE(TMRAx))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Configures the registers to reset value. */
        WRITE_REG16(TMRAx->BCSTR, 0x0002U);
        WRITE_REG16(TMRAx->ICONR, 0x0000U);
        WRITE_REG16(TMRAx->ECONR, 0x0000U);
        WRITE_REG16(TMRAx->CNTER, 0x0000U);
        WRITE_REG16(TMRAx->PERAR, 0xFFFFU);
        WRITE_REG16(TMRAx->FCONR, 0x0000U);
        WRITE_REG16(TMRAx->STFLR, 0x0000U);
        WRITE_REG16(TMRAx->HCONR, 0x0000U);
        WRITE_REG16(TMRAx->HCUPR, 0x0000U);
        WRITE_REG16(TMRAx->HCDOR, 0x0000U);

        if ((M4_TMRA3 == TMRAx) || (M4_TMRA4 == TMRAx))
        {
            u8ChCnt = TIMERA_PWM_CHANNEL_NUMBER;
            WRITE_REG16(TMRAx->BCONR, 0x0000U);
        }
        else
        {
            u8ChCnt = 1U;
        }

        for (i = 0U; i < u8ChCnt; i++)
        {
            TMRA_CMPAR = (__IO uint16_t *)TMRA_CMPARx(TMRAx, i);
            WRITE_REG16(*TMRA_CMPAR, 0xFFFFU);
            TMRA_CCONR = (__IO uint16_t *)TMRA_CCONRx(TMRAx, i);
            WRITE_REG16(*TMRA_CCONR, 0x0000U);
            TMRA_PCONR = (__IO uint16_t *)TMRA_PCONRx(TMRAx, i);
            WRITE_REG16(*TMRA_PCONR, 0x0000U);
        }

        WRITE_REG32(M4_AOS->TMRA0_HTSSR, TIMERA_TRIG_SRC_MASK);
        WRITE_REG32(M4_AOS->TMRA1_HTSSR, TIMERA_TRIG_SRC_MASK);
    }

    return enRet;
}

/**
 * @brief  Initialize TimerA base function.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] pstcInit                Pointer to a @ref stc_timera_init_t structure.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: TMRAx is invalid instance or pstcInit == NULL
 */
en_result_t TIMERA_Init(M4_TMRA_TypeDef *TMRAx,
                        stc_timera_init_t *pstcInit)
{
    en_result_t enRet = Ok;

