levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmra.c
    /* Check TMRAx instance and pstcInit */
    if ((!IS_TIMERA_NORMAL_INSTANCE(TMRAx)) || (NULL == pstcInit))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(0U != pstcInit->u16PeriodVal);
        DDL_ASSERT(IS_TIMERA_COUNT_MODE(pstcInit->u16CountMode));
        DDL_ASSERT(IS_TIMERA_COUNT_DIRECTION(pstcInit->u16CountDir));
        DDL_ASSERT(IS_TIMERA_SYNC_START(pstcInit->u16SyncStart));
        DDL_ASSERT(IS_TIMERA_CLK_DIV(pstcInit->u16ClkDiv));
        DDL_ASSERT(IS_TIMERA_OVERFLOW_STATE(pstcInit->u16OverflowAction));
        DDL_ASSERT(IS_TIMERA_HWSTART_CONDITION(pstcInit->u16HwStartCondition));
        DDL_ASSERT(IS_TIMERA_HWSTOP_CONDITION(pstcInit->u16HwStopCondition));
        DDL_ASSERT(IS_TIMERA_HWCLEAR_CONDITION(pstcInit->u16HwClearCondition));
        DDL_ASSERT(IS_TIMERA_HWUP_CONDITION(pstcInit->u16HwUpCondition));
        DDL_ASSERT(IS_TIMERA_HWDOWN_CONDITION(pstcInit->u16HwDownCondition));
        DDL_ASSERT(IS_TIMERA_TRIG_PORT_FILTER_STATE(pstcInit->u16TrigFilterState));
        DDL_ASSERT(IS_TIMERA_TRIG_PORT_FILTER_CLKDIV(pstcInit->u16TrigFilterClkDiv));
        DDL_ASSERT(IS_TIMERA_CLKA_PORT_FILTER_STATE(pstcInit->u16ClkAFilterState));
        DDL_ASSERT(IS_TIMERA_CLKA_PORT_FILTER_CLKDIV(pstcInit->u16ClkAFilterClkDiv));
        DDL_ASSERT(IS_TIMERA_CLKB_PORT_FILTER_STATE(pstcInit->u16ClkBFilterState));
        DDL_ASSERT(IS_TIMERA_CLKB_PORT_FILTER_CLKDIV(pstcInit->u16ClkBFilterClkDiv));

        WRITE_REG16(TMRAx->CNTER, 0U);
        WRITE_REG16(TMRAx->PERAR, pstcInit->u16PeriodVal);
        if ((M4_TMRA1 == TMRAx) || (M4_TMRA3 == TMRAx))
        {
            pstcInit->u16SyncStart = TIMERA_SYNC_START_DISABLE;
        }
        MODIFY_REG16(TMRAx->BCSTR,
                     (TMRA_BCSTR_DIR | TMRA_BCSTR_MODE | TMRA_BCSTR_OVSTP |
                     TMRA_BCSTR_CKDIV | TMRA_BCSTR_SYNST),
                     (pstcInit->u16CountMode | pstcInit->u16CountDir |
                      pstcInit->u16OverflowAction | pstcInit->u16ClkDiv |
                      pstcInit->u16SyncStart));

        /* Set External port filter */
        if ((M4_TMRA1 == TMRAx) || (M4_TMRA2 == TMRAx))
        {
            pstcInit->u16ClkBFilterState = TIMERA_CLKB_FILTER_DISABLE;
            pstcInit->u16ClkBFilterClkDiv = TIMERA_CLKB_CLKDIV_DIV1;
        }
        WRITE_REG16(TMRAx->FCONR,
                    (pstcInit->u16TrigFilterState | pstcInit->u16TrigFilterClkDiv |
                     pstcInit->u16ClkAFilterState | pstcInit->u16ClkAFilterClkDiv |
                     pstcInit->u16ClkBFilterState | pstcInit->u16ClkBFilterClkDiv));

        /* Set hardware trigger event */
        if ((M4_TMRA1 == TMRAx) || (M4_TMRA2 == TMRAx))
        {
            pstcInit->u16HwUpCondition &= ~0x00FFU;
            pstcInit->u16HwDownCondition &= ~0x00FFU;
        }
        WRITE_REG16(TMRAx->HCONR,
                    (pstcInit->u16HwStartCondition | pstcInit->u16HwStopCondition |
                     pstcInit->u16HwClearCondition));
        WRITE_REG16(TMRAx->HCUPR, pstcInit->u16HwUpCondition);
        WRITE_REG16(TMRAx->HCDOR, pstcInit->u16HwDownCondition);
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_timera_init_t to default values.
 * @param  [out] pstcInit               Pointer to a @ref stc_timera_init_t structure.
 * @retval An en_result_t enumeration value:
 *           - Ok: TMRAx structure Initialize success
 *           - ErrorInvalidParameter: pstcInit == NULL
 */
en_result_t TIMERA_StructInit(stc_timera_init_t *pstcInit)
{
    en_result_t enRet = Ok;

    /* Check parameters */
    if (NULL == pstcInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcInit->u16PeriodVal = 0xFFFFu;
        pstcInit->u16CountDir = TIMERA_COUNT_UP;
        pstcInit->u16CountMode = TIMERA_SAWTOOTH_WAVE;
        pstcInit->u16SyncStart = TIMERA_SYNC_START_DISABLE;
        pstcInit->u16ClkDiv = TIMERA_CLKDIV_DIV1;
        pstcInit->u16OverflowAction = TIMERA_OVERFLOW_COUNT;
        pstcInit->u16HwStartCondition = TIMERA_HWSTART_INVALID;
        pstcInit->u16HwStopCondition = TIMERA_HWSTOP_INVALID;
        pstcInit->u16HwClearCondition = TIMERA_HWCLEAR_INVALID;
        pstcInit->u16HwUpCondition = TIMERA_HWUP_INVALID;
        pstcInit->u16HwDownCondition = TIMERA_HWDOWN_INVALID;
        pstcInit->u16TrigFilterState = TIMERA_TRIG_FILTER_DISABLE;
        pstcInit->u16TrigFilterClkDiv = TIMERA_TRIG_CLKDIV_DIV1;
        pstcInit->u16ClkAFilterState = TIMERA_CLKA_FILTER_DISABLE;
        pstcInit->u16ClkAFilterClkDiv = TIMERA_CLKA_CLKDIV_DIV1;
        pstcInit->u16ClkBFilterState = TIMERA_CLKB_FILTER_DISABLE;
        pstcInit->u16ClkBFilterClkDiv = TIMERA_CLKB_CLKDIV_DIV1;
    }

    return enRet;
}

/**
 * @brief  Set the TimerA counter value.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u16Value                Counter value (between 0 and 0xFFFF)
 * @retval None
 */
void TIMERA_SetCounter(M4_TMRA_TypeDef *TMRAx, uint16_t u16Value)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));

    WRITE_REG16(TMRAx->CNTER, u16Value);
}

/**
 * @brief  Get the TimerA counter value.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @retval uint16_t                     Counter value (between 0 and 0xFFFF)
 */
uint16_t TIMERA_GetCounter(M4_TMRA_TypeDef *TMRAx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));

    return READ_REG16(TMRAx->CNTER);
}

/**
 * @brief  Set TimerA period register value.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u16Value                Period value (between 0 and 0xFFFF)
 * @retval None
 */
void TIMERA_SetPeriod(M4_TMRA_TypeDef *TMRAx, uint16_t u16Value)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));

    WRITE_REG16(TMRAx->PERAR, u16Value);
}

/**
 * @brief  Get TimerA period register value.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @retval uint16_t                     Period value (between 0 and 0xFFFF)
 */
uint16_t TIMERA_GetPeriod(M4_TMRA_TypeDef *TMRAx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));

    return READ_REG16(TMRAx->PERAR);
}

/**
 * @brief  Set TimerA clock division.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u16Div                  TimerA clock division
 *         This parameter can be one of the following values:
 *           @arg TIMERA_CLKDIV_DIV1:   PCLK1
 *           @arg TIMERA_CLKDIV_DIV2:   PCLK1/2
 *           @arg TIMERA_CLKDIV_DIV4:   PCLK1/4
 *           @arg TIMERA_CLKDIV_DIV8:   PCLK1/8
 *           @arg TIMERA_CLKDIV_DIV16:  PCLK1/16
 *           @arg TIMERA_CLKDIV_DIV32:  PCLK1/32
 *           @arg TIMERA_CLKDIV_DIV64:  PCLK1/64
 *           @arg TIMERA_CLKDIV_DIV128: PCLK1/128
 *           @arg TIMERA_CLKDIV_DIV256: PCLK1/256
 *           @arg TIMERA_CLKDIV_DIV512: PCLK1/512
 *           @arg TIMERA_CLKDIV_DIV1024:PCLK1/1024
 * @retval None
 */
void TIMERA_SetClkDiv(M4_TMRA_TypeDef *TMRAx, uint16_t u16Div)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CLK_DIV(u16Div));

    MODIFY_REG16(TMRAx->BCSTR, TMRA_BCSTR_CKDIV, u16Div);
}

/**
 * @brief  Enable or disable TimerA sync start.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TIMERA_SyncStartCmd(M4_TMRA_TypeDef *TMRAx,
                         en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_SYNC_INSTANCE(TMRAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

