levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmra.c
    if (Enable == enNewSta)
    {
        SET_REG16_BIT(TMRAx->BCSTR, TMRA_BCSTR_SYNST);
    }
    else
    {
        CLEAR_REG16_BIT(TMRAx->BCSTR, TMRA_BCSTR_SYNST);
    }
}

/**
 * @brief  Enable or disable TimerA compare match or trigger capture event output.
 * @note   The parameter u16EvtSource in Unit 1 or 2 can only be set to TIMERA_EVENT_CMP1
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u16EvtSource            TimerA event source
 *         This parameter can be one or any combination of the following values:
 *           @arg TIMERA_EVENT_CMP1: Chanel 1 compare match or trigger capture
 *           @arg TIMERA_EVENT_CMP2: Chanel 2 compare match or trigger capture
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TIMERA_EventCmd(M4_TMRA_TypeDef *TMRAx, uint16_t u16EvtSource,
                     en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_EVENT(u16EvtSource));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    if (Enable == enNewSta)
    {
        SET_REG16_BIT(TMRAx->ECONR, u16EvtSource);
    }
    else
    {
        CLEAR_REG16_BIT(TMRAx->ECONR, u16EvtSource);
    }
}

/**
 * @brief  Enable or disable TimerA.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TIMERA_Cmd(M4_TMRA_TypeDef *TMRAx, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    if (Enable == enNewSta)
    {
        SET_REG16_BIT(TMRAx->BCSTR, TMRA_BCSTR_START);
    }
    else
    {
        CLEAR_REG16_BIT(TMRAx->BCSTR, TMRA_BCSTR_START);
    }
}

/**
 * @brief  Set TimerA TRIG Port noise filter clock division.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u16Div                  TimerA TRIG Port noise filter clock division
 *         This parameter can be one of the following values:
 *           @arg TIMERA_TRIG_CLKDIV_DIV1:   PCLK1
 *           @arg TIMERA_TRIG_CLKDIV_DIV4:   PCLK1/4
 *           @arg TIMERA_TRIG_CLKDIV_DIV16:  PCLK1/16
 *           @arg TIMERA_TRIG_CLKDIV_DIV64:  PCLK1/64
 * @retval None
 */
void TIMERA_SetTrigFilterClkDiv(M4_TMRA_TypeDef *TMRAx, uint16_t u16Div)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_TRIG_PORT_FILTER_CLKDIV(u16Div));

    MODIFY_REG16(TMRAx->FCONR, TMRA_FCONR_NOFICKTG, u16Div);
}

/**
 * @brief  Enable or disable TimerA TRIG Port noise filter function.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TIMERA_TrigFilterCmd(M4_TMRA_TypeDef *TMRAx, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    if (Enable == enNewSta)
    {
        SET_REG16_BIT(TMRAx->FCONR, TMRA_FCONR_NOFIENTG);
    }
    else
    {
        CLEAR_REG16_BIT(TMRAx->FCONR, TMRA_FCONR_NOFIENTG);
    }
}

/**
 * @brief  Set TimerA CLKA Port noise filter clock division.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u16Div                  TimerA CLKA Port noise filter clock division
 *         This parameter can be one of the following values:
 *           @arg TIMERA_CLKA_CLKDIV_DIV1:   PCLK1
 *           @arg TIMERA_CLKA_CLKDIV_DIV4:   PCLK1/4
 *           @arg TIMERA_CLKA_CLKDIV_DIV16:  PCLK1/16
 *           @arg TIMERA_CLKA_CLKDIV_DIV64:  PCLK1/64
 * @retval None
 */
void TIMERA_SetClkAFilterClkDiv(M4_TMRA_TypeDef *TMRAx, uint16_t u16Div)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CLKA_PORT_FILTER_CLKDIV(u16Div));

    MODIFY_REG16(TMRAx->FCONR, TMRA_FCONR_NOFICKCA, u16Div);
}

/**
 * @brief  Enable or disable TimerA CLKA Port noise filter function.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TIMERA_ClkAFilterCmd(M4_TMRA_TypeDef *TMRAx, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

