levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmra.c
    if (Enable == enNewSta)
    {
        SET_REG16_BIT(TMRAx->FCONR, TMRA_FCONR_NOFIENCA);
    }
    else
    {
        CLEAR_REG16_BIT(TMRAx->FCONR, TMRA_FCONR_NOFIENCA);
    }
}

/**
 * @brief  Set TimerA CLKB Port noise filter clock division.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u16Div                  TimerA CLKB Port noise filter clock division
 *         This parameter can be one of the following values:
 *           @arg TIMERA_CLKB_CLKDIV_DIV1:   PCLK1
 *           @arg TIMERA_CLKB_CLKDIV_DIV4:   PCLK1/4
 *           @arg TIMERA_CLKB_CLKDIV_DIV16:  PCLK1/16
 *           @arg TIMERA_CLKB_CLKDIV_DIV64:  PCLK1/64
 * @retval None
 */
void TIMERA_SetClkBFilterClkDiv(M4_TMRA_TypeDef *TMRAx, uint16_t u16Div)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_SPECIAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CLKB_PORT_FILTER_CLKDIV(u16Div));

    MODIFY_REG16(TMRAx->FCONR, TMRA_FCONR_NOFICKCB, u16Div);
}

/**
 * @brief  Enable or disable TimerA CLKB Port noise filter function.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TIMERA_ClkBFilterCmd(M4_TMRA_TypeDef *TMRAx, en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_SPECIAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));


    if (Enable == enNewSta)
    {
        SET_REG16_BIT(TMRAx->FCONR, TMRA_FCONR_NOFIENCB);
    }
    else
    {
        CLEAR_REG16_BIT(TMRAx->FCONR, TMRA_FCONR_NOFIENCB);
    }
}

/**
 * @brief  Set TimerA hardware trigger counter Start/Stop/Clear condition.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u16Condition            TimerA hardware start counter condition
 *         This parameter can be one or any combination of the following values:
 *           @arg @ref TIMERA_Hardware_Start_Count_Condition
 *           @arg @ref TIMERA_Hardware_Stop_Count_Condition
 *           @arg @ref TIMERA_Hardware_Clear_Count_Condition
 * @retval  None
 */
void TIMERA_SetHwTriggerCondition(M4_TMRA_TypeDef *TMRAx, uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_HWTRIGGER_CONDITION(u16Condition));

    WRITE_REG16(TMRAx->HCONR, u16Condition);
}

/**
 * @brief  Get TimerA hardware trigger counter Start/Stop/Clear condition.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @retval Returned value can be one or any combination of the following values:
 *           @arg @ref TIMERA_Hardware_Start_Count_Condition
 *           @arg @ref TIMERA_Hardware_Stop_Count_Condition
 *           @arg @ref TIMERA_Hardware_Clear_Count_Condition
 */
uint16_t TIMERA_GetHwTriggerCondition(M4_TMRA_TypeDef *TMRAx)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));

    return READ_REG16(TMRAx->HCONR);
}

/**
 * @brief  Set TimerA hardware start counter condition.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u16Condition            TimerA hardware start counter condition
 *         This parameter can be one or any combination of the following values:
 *           @arg TIMERA_HWSTART_INVALID:       Hardware start is invalid
 *           @arg TIMERA_HWSTART_TRIG_RISING:   Hardware start counter by rising edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWSTART_TRIG_FALLING:  Hardware start counter by falling edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWSTART_SPECIFY_EVT:   Hardware start counter by the timer TMRA_HTSSR specified event
 * @retval  None
 */
void TIMERA_SetHwStartCondition(M4_TMRA_TypeDef *TMRAx, uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_HWSTART_CONDITION(u16Condition));

    MODIFY_REG16(TMRAx->HCONR, TIMERA_HCONR_HSTA_MASK, u16Condition);
}

/**
 * @brief  Set TimerA hardware stop counter condition.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u16Condition            TimerA hardware stop counter condition
 *         This parameter can be one or any combination of the following values:
 *           @arg TIMERA_HWSTOP_INVALID:        Hardware stop is invalid
 *           @arg TIMERA_HWSTOP_TRIG_RISING:    Hardware stop counter by rising edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWSTOP_TRIG_FALLING:   Hardware stop counter by falling edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWSTOP_SPECIFY_EVT:    Hardware stop counter by the timer TMRA_HTSSR specified event
 * @retval  None
 */
void TIMERA_SetHwStopCondition(M4_TMRA_TypeDef *TMRAx, uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_HWSTOP_CONDITION(u16Condition));

    MODIFY_REG16(TMRAx->HCONR, TIMERA_HCONR_HSTP_MASK, u16Condition);
}

/**
 * @brief  Set TimerA hardware clear counter condition.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u16Condition            TimerA hardware clear counter condition
 *         This parameter can be one or any combination of the following values:
 *           @arg TIMERA_HWCLEAR_INVALID:               Hardware clear is invalid
 *           @arg TIMERA_HWCLEAR_TRIG_RISING:           Hardware clear counter by rising edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWCLEAR_TRIG_FALLING:          Hardware clear counter by falling edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWCLEAR_SPECIFY_EVT:           Hardware clear counter by the timer TMRA_HTSSR specified event
 *           @arg TIMERA_HWCLEAR_UNIT_N_TRIG_RISING:    When this unit is m, the TIMA_<t>_TRIG input of unit n is rising edge to trigger the hardware clear count
 *           @arg TIMERA_HWCLEAR_UNIT_N_TRIG_FALLING:   When this unit is m, the TIMA_<t>_TRIG input of unit n is falling edge to trigger the hardware clear count
 * @retval  None
 */
void TIMERA_SetHwClearCondition(M4_TMRA_TypeDef *TMRAx, uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_HWCLEAR_CONDITION(u16Condition));

    MODIFY_REG16(TMRAx->HCONR, TIMERA_HCONR_HCLE_MASK, u16Condition);
}

/**
 * @brief  Set TimerA hardware up counter condition.
 * @note   The parameter u16Condition in Unit 1 or 2 can only be set to TIMERA_HWUP_TRIG_RISING
 *         and TIMERA_HWUP_TRIG_FALLING and TIMERA_HWUP_SPECIFY_EVT
 *         and TIMERA_HWUP_UNIT_N_COUNT_OVERFLOW and TIMERA_HWUP_UNIT_N_COUNT_UNDERFLOW.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u16Condition            TimerA hardware up counter condition
 *         This parameter can be one or any combination of the following values:
 *           @arg TIMERA_HWUP_INVALID:                  Hardware count up is invalid
 *           @arg TIMERA_HWUP_CLKA_LOW_CLKB_RISING:     Hardware count up by rising edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is low level
 *           @arg TIMERA_HWUP_CLKA_LOW_CLKB_FALLING:    Hardware count up by falling edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is low level
 *           @arg TIMERA_HWUP_CLKA_HIGH_CLKB_RISING:    Hardware count up by rising edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is high level
 *           @arg TIMERA_HWUP_CLKA_HIGH_CLKB_FALLING:   Hardware count up by falling edge on timer input TIMA_<t>_CLKB when TIMA_<t>_CLKA is high level
 *           @arg TIMERA_HWUP_CLKB_LOW_CLKA_RISING:     Hardware count up by rising edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is low level
 *           @arg TIMERA_HWUP_CLKB_LOW_CLKA_FALLING:    Hardware count up by falling edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is low level
 *           @arg TIMERA_HWUP_CLKB_HIGH_CLKA_RISING:    Hardware count up by rising edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is high level
 *           @arg TIMERA_HWUP_CLKB_HIGH_CLKA_FALLING:   Hardware count up by falling edge on timer input TIMA_<t>_CLKA when TIMA_<t>_CLKB is high level
 *           @arg TIMERA_HWUP_TRIG_RISING:              Hardware count up by rising edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWUP_TRIG_FALLING:             Hardware count up by falling edge on timer input TIMA_<t>_TRIG
 *           @arg TIMERA_HWUP_SPECIFY_EVT:              Hardware count up by the timer TMRA_HTSSR specified event
 *           @arg TIMERA_HWUP_UNIT_N_COUNT_OVERFLOW:    When this unit is m, unit n generates a count overflow to trigger hardware count up
 *           @arg TIMERA_HWUP_UNIT_N_COUNT_UNDERFLOW:   When this unit is m, unit n generates a count underflow to trigger hardware count up
 * @retval  None
 */
void TIMERA_SetHwUpCondition(M4_TMRA_TypeDef *TMRAx, uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_HWUP_CONDITION(u16Condition));

