levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmra.c
        /* Configures the registers to reset value. */
        TMRA_CMPAR = (__IO uint16_t *)TMRA_CMPARx(TMRAx, u8Channel);
        WRITE_REG16(*TMRA_CMPAR, 0xFFFFU);
        TMRA_CCONR = (__IO uint16_t *)TMRA_CCONRx(TMRAx, u8Channel);
        CLEAR_REG16_BIT(*TMRA_CCONR, TMRA_CCONR_CAPMD);
        TMRA_PCONR = (__IO uint16_t *)TMRA_PCONRx(TMRAx, u8Channel);
        WRITE_REG16(*TMRA_PCONR, 0x0000U);

        if ((M4_TMRA3 == TMRAx) || (M4_TMRA4 == TMRAx))
        {
            WRITE_REG16(TMRAx->BCONR, 0x0000U);
        }
    }

    return enRet;
}

/**
 * @brief  Initialize TimerA output compare function.
 * @note   The parameter u8Channel in Unit 1 or 2 can only be set to TIMERA_CHANNEL_CH1
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u8Channel               TimerA output compare channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @param  [in] pstcOcInit              Pointer to a @ref stc_timera_oc_init_t structure.
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize success
 *           - ErrorInvalidParameter: TMRAx is invalid instance or pstcOcInit == NULL
 */
en_result_t TIMERA_OC_Init(M4_TMRA_TypeDef *TMRAx, uint8_t u8Channel,
                           const stc_timera_oc_init_t *pstcOcInit)
{
    __IO uint16_t *TMRA_CMPAR;
    __IO uint16_t *TMRA_CCONR;
    __IO uint16_t *TMRA_PCONR;
    en_result_t enRet = Ok;

    /* Check TMRAx instance and pstcOcInit */
    if ((!IS_TIMERA_NORMAL_INSTANCE(TMRAx)) || (NULL == pstcOcInit))
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));
        DDL_ASSERT(IS_TIMERA_OC_FORCE_OUTPUT_POLARITY(pstcOcInit->u16PortOutputState));
        DDL_ASSERT(IS_TIMERA_OC_START_COUNT_OUTPUT_POLARITY(pstcOcInit->u16StartCountOutput));
        DDL_ASSERT(IS_TIMERA_OC_STOP_COUNT_OUTPUT_POLARITY(pstcOcInit->u16StopCountOutput));
        DDL_ASSERT(IS_TIMERA_OC_CMPMATCH_OUTPUT_POLARITY(pstcOcInit->u16CompareMatchOutput));
        DDL_ASSERT(IS_TIMERA_OC_PERIODMATCH_OUTPUT_POLARITY(pstcOcInit->u16PeriodMatchOutput));
        DDL_ASSERT(IS_TIMERA_OC_CACHE_STATE(pstcOcInit->u16CacheState));
        DDL_ASSERT(IS_TIMERA_OC_CACHE_TRANS_CONDITION(pstcOcInit->u16CacheTransmitCondition));

        TMRA_CMPAR = (__IO uint16_t *)TMRA_CMPARx(TMRAx, u8Channel);
        WRITE_REG16(*TMRA_CMPAR, pstcOcInit->u16CompareVal);
        /* Configure output compare */
        TMRA_CCONR = (__IO uint16_t *)TMRA_CCONRx(TMRAx, u8Channel);
        CLEAR_REG16_BIT(*TMRA_CCONR, TMRA_CCONR_CAPMD);
        TMRA_PCONR = (__IO uint16_t *)TMRA_PCONRx(TMRAx, u8Channel);
        MODIFY_REG16(*TMRA_PCONR,
                     (TMRA_PCONR_STAC | TMRA_PCONR_STPC | TMRA_PCONR_CMPC |
                      TMRA_PCONR_PERC | TMRA_PCONR_FORC),
                     (pstcOcInit->u16StartCountOutput | pstcOcInit->u16StopCountOutput |
                      pstcOcInit->u16CompareMatchOutput | pstcOcInit->u16PeriodMatchOutput |
                      pstcOcInit->u16PortOutputState));

        if ((M4_TMRA3 == TMRAx) || (M4_TMRA4 == TMRAx))
        {
            WRITE_REG16(TMRAx->BCONR, (pstcOcInit->u16CacheState | pstcOcInit->u16CacheTransmitCondition));
        }
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_timera_oc_init_t to default values.
 * @param  [out] pstcOcInit             Pointer to a @ref stc_timera_oc_init_t structure (TMRAx unit output compare function configuration data structure).
 * @retval None
 */
en_result_t TIMERA_OC_StructInit(stc_timera_oc_init_t *pstcOcInit)
{
    en_result_t enRet = Ok;

    /* Check parameters */
    if (NULL == pstcOcInit)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        pstcOcInit->u16CompareVal = 0xFFFFu;
        pstcOcInit->u16PortOutputState = TIMERA_OC_FORCE_OUTPUT_INVALID;
        pstcOcInit->u16StartCountOutput = TIMERA_OC_STARTCOUNT_OUTPUT_LOW;
        pstcOcInit->u16StopCountOutput = TIMERA_OC_STOPCOUNT_OUTPUT_LOW;
        pstcOcInit->u16CompareMatchOutput = TIMERA_OC_CMPMATCH_OUTPUT_LOW;
        pstcOcInit->u16PeriodMatchOutput = TIMERA_OC_PERIODMATCH_OUTPUT_LOW;
        pstcOcInit->u16CacheState = TIMERA_OC_CACHE_DISABLE;
        pstcOcInit->u16CacheTransmitCondition = TIMERA_OC_CACHE_TRANSMIT_INVALID;
    }

    return enRet;
}

/**
 * @brief  Set TimerA compare register value.
 * @note   The parameter u8Channel in Unit 1 or 2 can only be set to TIMERA_CHANNEL_CH1
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u8Channel               TimerA output compare channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @param  [in] u16Value Compare value (between 0 and 0xFFFF)
 * @retval None
 */
void TIMERA_OC_SetCompare(M4_TMRA_TypeDef *TMRAx, uint8_t u8Channel,
                          uint16_t u16Value)
{
    __IO uint16_t *TMRA_CMPAR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));

