levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmra.c
    TMRA_CMPAR = (__IO uint16_t *)TMRA_CMPARx(TMRAx, u8Channel);
    WRITE_REG16(*TMRA_CMPAR, u16Value);
}

/**
 * @brief  Enable or Disable TimerA PWM output function.
 * @note   The parameter u8Channel in Unit 1 or 2 can only be set to TIMERA_CHANNEL_CH1
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u8Channel               TimerA output compare channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TIMERA_OC_PwmCmd(M4_TMRA_TypeDef *TMRAx, uint8_t u8Channel,
                      en_functional_state_t enNewSta)
{
    __IO uint16_t *TMRA_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    TMRA_PCONR = (__IO uint16_t *)TMRA_PCONRx(TMRAx, u8Channel);
    if (Enable == enNewSta)
    {
        SET_REG16_BIT(*TMRA_PCONR, TMRA_PCONR_OUTEN);
    }
    else
    {
        CLEAR_REG16_BIT(*TMRA_PCONR, TMRA_PCONR_OUTEN);
    }
}

/**
 * @brief  Set TIMA_<t>_PWMn port output polarity when start count.
 * @note   The parameter u8Channel in Unit 1 or 2 can only be set to TIMERA_CHANNEL_CH1
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u8Channel               TimerA output compare channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @param  [in] u16Polarity             TimerA TIMA_<t>_PWMn port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERA_OC_STARTCOUNT_OUTPUT_LOW:  TIMA_<t>_PWMn output low level when TimerA start count
 *           @arg TIMERA_OC_STARTCOUNT_OUTPUT_HIGH: TIMA_<t>_PWMn output high level when TimerA start count
 *           @arg TIMERA_OC_STARTCOUNT_OUTPUT_HOLD: TIMA_<t>_PWMn output hold level when TimerA start count
 * @retval None
 */
void TIMERA_OC_SetStartCountOutputPolarity(M4_TMRA_TypeDef *TMRAx,
                                           uint8_t u8Channel,
                                           uint16_t u16Polarity)
{
    __IO uint16_t *TMRA_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));
    DDL_ASSERT(IS_TIMERA_OC_START_COUNT_OUTPUT_POLARITY(u16Polarity));

    TMRA_PCONR = (__IO uint16_t *)TMRA_PCONRx(TMRAx, u8Channel);
    MODIFY_REG16(*TMRA_PCONR, TMRA_PCONR_STAC, u16Polarity);
}

/**
 * @brief  Set TIMA_<t>_PWMn port output polarity for stop count.
 * @note   The parameter u8Channel in Unit 1 or 2 can only be set to TIMERA_CHANNEL_CH1
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u8Channel               TimerA output compare channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @param  [in] u16Polarity             TimerA TIMA_<t>_PWMn port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERA_OC_STOPCOUNT_OUTPUT_LOW:   TIMA_<t>_PWMn output low level when TimerA stop count
 *           @arg TIMERA_OC_STOPCOUNT_OUTPUT_HIGH:  TIMA_<t>_PWMn output high level when TimerA stop count
 *           @arg TIMERA_OC_STOPCOUNT_OUTPUT_HOLD:  TIMA_<t>_PWMn output hold level when TimerA stop count
 * @retval None
 */
void TIMERA_OC_SetStopCountOutputPolarity(M4_TMRA_TypeDef *TMRAx,
                                          uint8_t u8Channel,
                                          uint16_t u16Polarity)
{
    __IO uint16_t *TMRA_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));
    DDL_ASSERT(IS_TIMERA_OC_STOP_COUNT_OUTPUT_POLARITY(u16Polarity));

    TMRA_PCONR = (__IO uint16_t *)TMRA_PCONRx(TMRAx, u8Channel);
    MODIFY_REG16(*TMRA_PCONR, TMRA_PCONR_STPC, u16Polarity);
}

/**
 * @brief  Set TIMA_<t>_PWMn port output polarity for compare match.
 * @note   The parameter u8Channel in Unit 1 or 2 can only be set to TIMERA_CHANNEL_CH1
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u8Channel               TimerA output compare channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @param  [in] u16Polarity             TimerA TIMA_<t>_PWMn port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERA_OC_CMPMATCH_OUTPUT_LOW:        TIMA_<t>_PWMn output low level when TimerA comapre match
 *           @arg TIMERA_OC_CMPMATCH_OUTPUT_HIGH:       TIMA_<t>_PWMn output high level when TimerA comapre match
 *           @arg TIMERA_OC_CMPMATCH_OUTPUT_HOLD:       TIMA_<t>_PWMn output hold level when TimerA comapre match
 *           @arg TIMERA_OC_CMPMATCH_OUTPUT_INVERTED:   TIMA_<t>_PWMn output inverted level when TimerA comapre match
 * @retval None
 */
void TIMERA_OC_SetCmpMatchOutputPolarity(M4_TMRA_TypeDef *TMRAx,
                                         uint8_t u8Channel,
                                         uint16_t u16Polarity)
{
    __IO uint16_t *TMRA_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));
    DDL_ASSERT(IS_TIMERA_OC_CMPMATCH_OUTPUT_POLARITY(u16Polarity));

