levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmra.c
    TMRA_PCONR = (__IO uint16_t *)TMRA_PCONRx(TMRAx, u8Channel);
    MODIFY_REG16(*TMRA_PCONR, TMRA_PCONR_CMPC, u16Polarity);
}

/**
 * @brief  Set TIMA_<t>_PWMn port output polarity for period match.
 * @note   The parameter u8Channel in Unit 1 or 2 can only be set to TIMERA_CHANNEL_CH1
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u8Channel               TimerA output compare channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @param  [in] u16Polarity             TimerA TIMA_<t>_PWMn port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERA_OC_PERIODMATCH_OUTPUT_LOW:         TIMA_<t>_PWMn output low level when TimerA period match
 *           @arg TIMERA_OC_PERIODMATCH_OUTPUT_HIGH:        TIMA_<t>_PWMn output high level when TimerA period match
 *           @arg TIMERA_OC_PERIODMATCH_OUTPUT_HOLD:        TIMA_<t>_PWMn output hold level when TimerA period match
 *           @arg TIMERA_OC_PERIODMATCH_OUTPUT_INVERTED:    TIMA_<t>_PWMn output inverted level when TimerA period match
 * @retval None
 */
void TIMERA_OC_SetPeriodMatchOutputPolarity(M4_TMRA_TypeDef *TMRAx,
                                            uint8_t u8Channel,
                                            uint16_t u16Polarity)
{
    __IO uint16_t *TMRA_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));
    DDL_ASSERT(IS_TIMERA_OC_PERIODMATCH_OUTPUT_POLARITY(u16Polarity));

    TMRA_PCONR = (__IO uint16_t *)TMRA_PCONRx(TMRAx, u8Channel);
    MODIFY_REG16(*TMRA_PCONR, TMRA_PCONR_PERC, u16Polarity);
}

/**
 * @brief  Set TIMA_<t>_PWMn port output polarity for force.
 * @note   The parameter u8Channel in Unit 1 or 2 can only be set to TIMERA_CHANNEL_CH1
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u8Channel               TimerA output compare channel
           This parameter can be one of the following values:
             @arg TIMERA_CHANNEL_CH1:   TimerA PWM Channel 1
             @arg TIMERA_CHANNEL_CH2:   TimerA PWM Channel 2
 * @param  [in] u16Polarity             TimerA TIMA_<t>_PWMn port output polarity
 *         This parameter can be one of the following values:
 *           @arg TIMERA_OC_FORCE_OUTPUT_LOW:       Force TIMA_<t>_PWMn output low level
 *           @arg TIMERA_OC_FORCE_OUTPUT_HIGH:      Force TIMA_<t>_PWMn output high level
 *           @arg TIMERA_OC_FORCE_OUTPUT_INVALID:   Force invalid
 * @retval None
 */
void TIMERA_OC_SetForceOutputPolarity(M4_TMRA_TypeDef *TMRAx,
                                      uint8_t u8Channel,
                                      uint16_t u16Polarity)
{
    __IO uint16_t *TMRA_PCONR;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CHANNEL(u8Channel));
    DDL_ASSERT(IS_TIMERA_OC_FORCE_OUTPUT_POLARITY(u16Polarity));

    TMRA_PCONR = (__IO uint16_t *)TMRA_PCONRx(TMRAx, u8Channel);
    MODIFY_REG16(*TMRA_PCONR, TMRA_PCONR_FORC, u16Polarity);
}

/**
 * @brief  Enable or Disable TimerA PWM output cache function.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TIMERA_OC_CacheCmd(M4_TMRA_TypeDef *TMRAx,
                        en_functional_state_t enNewSta)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_SPECIAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    if (Enable == enNewSta)
    {
        SET_REG16_BIT(TMRAx->BCONR, TMRA_BCONR_BEN);
    }
    else
    {
        CLEAR_REG16_BIT(TMRAx->BCONR, TMRA_BCONR_BEN);
    }
}

/**
 * @brief  Set TimerA PWM output cache transmit condition.
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u16Condition            TimerA input capture condition
 *         This parameter can be one or any combination of the following values:
 *           @arg TIMERA_OC_CACHE_TRANSMIT_CREST:   In Triangular wave crest transmit cache value
 *           @arg TIMERA_OC_CACHE_TRANSMIT_TROUGH:  In Triangular wave trough transmit cache value
 *           @arg TIMERA_OC_CACHE_TRANSMIT_INVALID: Invalid cache transmit
 * @retval None
 */
void TIMERA_OC_SetCacheTransmitCondition(M4_TMRA_TypeDef *TMRAx,
                                         uint16_t u16Condition)
{
    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_SPECIAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_OC_CACHE_TRANS_CONDITION(u16Condition));

    MODIFY_REG16(TMRAx->BCONR, TIMERA_BCONR_BSE_MASK, u16Condition);
}

/**
 * @brief  Enable or disable specified TimerA interrupt.
 * @note   The parameter u16IntSource in Unit 1 or 2 can only be set to TIMERA_INT_OVF
 *         and TIMERA_INT_UDF and TIMERA_INT_CMP1
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u16IntSource            TimerA interrupt source
 *         This parameter can be one or any combination of the following values:
 *           @arg TIMERA_INT_OVF:       Overflow interrupt
 *           @arg TIMERA_INT_UDF:       Underflow interrupt
 *           @arg TIMERA_INT_CMP1:      PWM Channel 1 Compare match interrupt
 *           @arg TIMERA_INT_CMP2:      PWM Channel 2 Compare match interrupt
 * @param  [in] enNewSta                The function new state.
 *           @arg  This parameter can be: Enable or Disable.
 * @retval None
 */
void TIMERA_IntCmd(M4_TMRA_TypeDef *TMRAx,
                   uint16_t u16IntSource,
                   en_functional_state_t enNewSta)
{
    uint16_t u16Tmp;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_INT(u16IntSource));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewSta));

    /* OVF and UDF interrupt */
    u16Tmp = u16IntSource & 0xFF00U;
    if (0U != u16Tmp)
    {
        if (Enable == enNewSta)
        {
            SET_REG16_BIT(TMRAx->BCSTR, u16Tmp);
        }
        else
        {
            CLEAR_REG16_BIT(TMRAx->BCSTR, u16Tmp);
        }
    }

    /* Count match interrupt */
    u16Tmp = u16IntSource & 0x00FFu;
    if (0U != u16Tmp)
    {
        if (Enable == enNewSta)
        {
            SET_REG16_BIT(TMRAx->ICONR, u16Tmp);
        }
        else
        {
            CLEAR_REG16_BIT(TMRAx->ICONR, u16Tmp);
        }
    }
}

/**
 * @brief  Get TimerA flag status.
 * @note   The parameter u16IntSource in Unit 1 or 2 can only be set to TIMERA_FLAG_OVF
 *         and TIMERA_FLAG_UDF and TIMERA_FLAG_CMP1
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u16Flag                 TimerA flag type
 *         This parameter can be one of the following values:
 *           @arg TIMERA_FLAG_OVF:      Overflow flag
 *           @arg TIMERA_FLAG_UDF:      Underflow flag
 *           @arg TIMERA_FLAG_CMP1:     PWM Channel 1 compare match flag
 *           @arg TIMERA_FLAG_CMP2:     PWM Channel 2 compare match flag
 * @retval An en_flag_status_t enumeration value:
 *           - Set: Flag is set
 *           - Reset: Flag is reset
 */
en_flag_status_t TIMERA_GetFlag(M4_TMRA_TypeDef *TMRAx, uint16_t u16Flag)
{
    en_flag_status_t enFlag = Reset;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_GET_FLAG(u16Flag));

    switch (u16Flag)
    {
        case TIMERA_FLAG_OVF:
        case TIMERA_FLAG_UDF:
            enFlag = (READ_REG16_BIT(TMRAx->BCSTR, u16Flag)) ? Set : Reset;
            break;
        case TIMERA_FLAG_CMP1:
        case TIMERA_FLAG_CMP2:
            enFlag = (READ_REG16_BIT(TMRAx->STFLR, u16Flag)) ? Set : Reset;
            break;
        default:
            break;
    }

