levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmra.c
    return enFlag;
}

/**
 * @brief  Clear TimerA flag.
 * @note   The parameter u16IntSource in Unit 1 or 2 can only be set to TIMERA_FLAG_OVF
 *         and TIMERA_FLAG_UDF and TIMERA_FLAG_CMP1
 * @param  [in] TMRAx                   Pointer to TimerA instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMRA1:             TimerA unit 1 instance register base
 *           @arg M4_TMRA2:             TimerA unit 2 instance register base
 *           @arg M4_TMRA3:             TimerA unit 3 instance register base
 *           @arg M4_TMRA4:             TimerA unit 4 instance register base
 * @param  [in] u16Flag                 TimerA flag type
 *         This parameter can be one or any combination of the following values:
 *           @arg TIMERA_FLAG_OVF:      Overflow flag
 *           @arg TIMERA_FLAG_UDF:      Underflow flag
 *           @arg TIMERA_FLAG_CMP1:     PWM Channel 1 compare match flag
 *           @arg TIMERA_FLAG_CMP2:     PWM Channel 2 compare match flag
 * @retval None
 */
void TIMERA_ClearFlag(M4_TMRA_TypeDef *TMRAx, uint16_t u16Flag)
{
    uint16_t u16Tmp;

    /* Check parameters */
    DDL_ASSERT(IS_TIMERA_NORMAL_INSTANCE(TMRAx));
    DDL_ASSERT(IS_TIMERA_CLEAR_FLAG(u16Flag));

    /* OVF and UDF flag */
    u16Tmp = u16Flag & 0xFF00U;
    if (0U != u16Tmp)
    {
        CLEAR_REG16_BIT(TMRAx->BCSTR, u16Tmp);
    }

    /* Count match flag */
    u16Tmp = u16Flag & 0x00FFu;
    if (0U != u16Tmp)
    {
        CLEAR_REG16_BIT(TMRAx->STFLR, u16Tmp);
    }
}

/**
 * @}
 */

#endif /* DDL_TIMERA_ENABLE */

/**
 * @}
 */

/**
* @}
*/

/******************************************************************************
 * EOF (not truncated)
 *****************************************************************************/
